app/Models/Mymodel.php

    public function get_assign_history($lead_id) {
        $builder = $this->db->table('lead_assign_history');
        $builder->select('lead_assign_history.*, u_to.user_name as to_name, u_from.user_name as from_name');
        $builder->join('users as u_to', 'u_to.id = lead_assign_history.assign_to', 'left');
        $builder->join('users as u_from', 'u_from.id = lead_assign_history.assign_form', 'left');
        $builder->where('lead_assign_history.lead_id', $lead_id);
        $builder->orderBy('date_time', 'DESC');
        return $builder->get()->getResult();
---
SELECT `lds_lead_assign_history`.*, `u_to`.`user_name` as `to_name`, `u_from`.`user_name` as `from_name`
FROM `lds_lead_assign_history`
LEFT JOIN `lds_users` as `u_to` ON `u_to`.`id` = `lds_lead_assign_history`.`assign_to`
LEFT JOIN `lds_users` as `u_from` ON `u_from`.`id` = `lds_lead_assign_history`.`assign_form`
WHERE `lds_lead_assign_history`.`lead_id` = '24'
ORDER BY `date_time` DESC